title: Security-Enabled Global Group Deletion
id: 4730-security-enabled-global-group-deletion
description: Detects when a security-enabled global group is deleted.
status: experimental
author: Starfunkel
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4730
    condition: selection
fields:
    - EventID
    - GroupName
    - GroupDomain
    - SubjectUserName
    - SubjectDomainName
falsepositives:
    - Legitimate global group deletion
level: medium
tags:
    - attack.persistence