title: Member Added to Security-Enabled Local Group
id: 4732-member-added-security-enabled-local-group
description: Detects when a member is added to a security-enabled local group.
status: experimental
author: Starfunkel
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4732
    condition: selection
fields:
    - EventID
    - MemberName
    - GroupName
    - GroupDomain
    - SubjectUserName
    - SubjectDomainName
falsepositives:
    - Legitimate member addition
level: medium
tags:
    - attack.persistence