title: The workstation was locked
id: f82d2c27-9b57-40b3-a63d-8e9b9818b8d29
description: Detects workstation was locked
status: experimental
author: Starfunkel
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4800
    condition: selection
fields:
    - EventID
    - TargetUserName
    - IpAddress
    - WorkstationName
falsepositives:
    - Unknown
level: low
tags:
    - attack.persistence