title: The workstation was unlocked
id: f82d2c27-9b57-40b3-a63d-8e9b9818b8d28
description: Detects the workstation was unlocked
status: experimental
author: Starfunkel
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4801
    condition: selection
fields:
    - EventID
    - TargetUserName
    - IpAddress
    - WorkstationName
falsepositives:
    - Unknown
level: low
tags:
    - attack.persistence